# Importing the Libraries for Data Processing

In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder


# Importing the Dataset as a csv and visualising it

In [2]:
dataset = pd.read_csv("C:\\Users\\Agrim Nautiyal\\Desktop\\Data Science-ML competitions\\Kaggle Competitions\\Titanic\\Datasets\\train.csv")
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Looking at individual components :



## Data Cleaning - Identifying and filling missing values

In [3]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

### Here we observe that there are 177 empty values in the age column and 687 empty values in cabin

In [4]:
dataset['Age'] = dataset['Age'].fillna(dataset['Age'].mean())

In [5]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

### Making a judgement call :

In [7]:
dataset = dataset.drop(['Cabin'], axis = 1)
dataset = dataset.drop(['PassengerId'], axis = 1)

In [8]:
dataset.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

### Separating target from features :

In [9]:
features = dataset.drop(['Survived'], 1)
target = dataset[['Survived']]
#same as target = pd.DataFrame(dataset['Survived'])

## Data Formatting (Encoding)

### Label Encoding - Approach :

### Split dataframe into numerical and categorical dataframes
### Preprocess numerical data (already done)
### Preprocess categorical data (Label Encode)
### Combine both the preprocessed dataframes back into a single data frame

In [10]:
#SPLITTING DATAFRAME

numeric = ['int16', 'int32', 'int64', 'float16','float32', 'float64']
cat = ['object']

features_num = features.select_dtypes(include = numeric)
features_cat = features.select_dtypes(include = cat)

In [11]:
features_num.head()

   Pclass   Age  SibSp  Parch     Fare
0       3  22.0      1      0   7.2500
1       1  38.0      1      0  71.2833
2       3  26.0      0      0   7.9250
3       1  35.0      1      0  53.1000
4       3  35.0      0      0   8.0500

In [12]:
features_num.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
Pclass    891 non-null int64
Age       891 non-null float64
SibSp     891 non-null int64
Parch     891 non-null int64
Fare      891 non-null float64
dtypes: float64(2), int64(3)
memory usage: 34.9 KB

In [13]:
features_cat.head()

,Name,Sex,Ticket,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,S
4,"Allen, Mr. William Henry",male,373450,S

In [14]:
features_cat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
Name        891 non-null object
Sex         891 non-null object
Ticket      891 non-null object
Embarked    891 non-null object
dtypes: object(4)
memory usage: 27.9+ KB

#### Preprocessing on numerical and categorical dataframes :

In [15]:
#here there is no need to standardise numerical dataframe
#going directly to preprocessing of categorical DF and converting it to a numerical structure : 

#first use the above data cleaning techniques - check for NaN and drop irrelvant columns - Refer to CSV for better understanding


### Some ideas for preprocessing : 

#### 1) Check name - Keep only last name instead of dropping all the columns 
#### 2) Check ticket - Extract only the alphabetical data  and create a new feature, drop the remaining data
#### 3) Label encode the entire new dataframe

In [16]:
#extract only last name :

In [18]:
for i in range(len(features_cat)):
    features_cat['Name'][i] = features_cat['Name'][i].replace(features_cat['Name'][i], features_cat['Name'][i].split()[-1])

C:\Users\Agrim Nautiyal\Anaconda3\envs\dsenv\lib\site-packages\IPython\core\interactiveshell.py:2961: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

In [19]:
features_cat['Name'] = features_cat['Name'].str.extract('([A-Z]\w{0,})')

C:\Users\Agrim Nautiyal\Anaconda3\envs\dsenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [20]:
features_cat.head()

     Name     Sex            Ticket Embarked
0  Harris    male         A/5 21171        S
1  Thayer  female          PC 17599        C
2   Laina  female  STON/O2. 3101282        S
3    Peel  female            113803        S
4   Henry    male            373450        S

#### Extracting useful information from columns :

In [21]:
#extract only the first alphabet from ticket column  : 

for i in range(len(features_cat['Ticket'])):
    ch=features_cat['Ticket'][i][0]
    if (ch>='A' and ch <='Z') or (ch>='a' and ch<='z'):
        features_cat['Ticket'][i] = ch
    else:
        features_cat['Ticket'][i]=''

C:\Users\Agrim Nautiyal\Anaconda3\envs\dsenv\lib\site-packages\IPython\core\interactiveshell.py:2961: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

In [22]:
features_cat.head()

     Name     Sex Ticket Embarked
0  Harris    male      A        S
1  Thayer  female      P        C
2   Laina  female      S        S
3    Peel  female               S
4   Henry    male               S

In [23]:
#look into ticket 
#label encoding and then onehot encoding it :

#### Label Encoding categorical data

In [24]:
le = LabelEncoder()
features_cat = features_cat.apply(le.fit_transform)

In [25]:
features_cat.head()

   Name  Sex  Ticket  Embarked
0   246    1       1         2
1   535    0       5         0
2   329    0       6         2
3   447    0       0         2
4   258    1       0         2

#### OneHotEncoding column to remove bias :

In [26]:
df = np.array(features_cat['Sex'])

In [27]:
oe = OneHotEncoder()
sex_transform = oe.fit_transform(df.reshape(-1,1))

In [28]:
one_hot_df_sex = pd.DataFrame(sex_transform.toarray().astype(int))

In [29]:
#new data frame after sex one hot encoding : 
features_cat_new = pd.concat([features_cat, one_hot_df_sex], 1)

In [30]:
features_cat_new.head()

   Name  Sex  Ticket  Embarked  0  1
0   246    1       1         2  0  1
1   535    0       5         0  1  0
2   329    0       6         2  1  0
3   447    0       0         2  1  0
4   258    1       0         2  0  1

In [31]:
#now we can drop the sex column as it is aptly represented in the table

features_cat_new = features_cat_new.drop(['Sex'], 1)

In [32]:
features_cat_new.head()

   Name  Ticket  Embarked  0  1
0   246       1         2  0  1
1   535       5         0  1  0
2   329       6         2  1  0
3   447       0         2  1  0
4   258       0         2  0  1

#### Joining numerical and categorical DataFrames to obtain preprocessed data

In [33]:
#finally we combine the two data  frames into one : numerical and categorical ->->->

features_preprocessed = pd.concat([features_num, features_cat_new],1)

In [34]:
features_preprocessed.head()

   Pclass   Age  SibSp  Parch     Fare  Name  Ticket  Embarked  0  1
0       3  22.0      1      0   7.2500   246       1         2  0  1
1       1  38.0      1      0  71.2833   535       5         0  1  0
2       3  26.0      0      0   7.9250   329       6         2  1  0
3       1  35.0      1      0  53.1000   447       0         2  1  0
4       3  35.0      0      0   8.0500   258       0         2  0  1